* Timesheet

** hello-world, lasagna, amusement-park, and amusement-park-improvements
:LOGBOOK:
Amusement Park Improvements
CLOCK: [2022-03-31 Thu 00:11]--[2022-03-31 Thu 00:19] =>  0:08
Amusement Park
CLOCK: [2022-03-30 Wed 23:45]--[2022-03-31 Thu 00:04] =>  0:19
Lasagna
CLOCK: [2022-03-30 Wed 23:21]--[2022-03-30 Wed 23:42] =>  0:21
CLOCK: [2022-03-30 Wed 23:11]--[2022-03-30 Wed 23:15] =>  0:04
Hello World
CLOCK: [2022-03-30 Wed 00:53]--[2022-03-30 Wed 00:54] =>  0:01
:END:
#+BEGIN: clocktable :scope subtree :maxlevel 2
#+CAPTION: Clock summary at [2022-03-31 Thu 18:35]
| Headline     | Time   |
|--------------+--------|
| *Total time* | *0:53* |
|--------------+--------|
| Basics [66%] | 0:53   |
#+END:

** log-line-parser
:LOGBOOK:
Log Line Parser
CLOCK: [2022-04-13 Wed 00:55]--[2022-04-13 Wed 01:11] =>  0:16
:END:
#+BEGIN: clocktable :scope subtree :maxlevel 2
#+CAPTION: Clock summary at [2022-04-13 Wed 01:19]
| Headline     | Time   |
|--------------+--------|
| *Total time* | *0:16* |
|--------------+--------|
| Basics [71%] | 0:16   |
#+END:

** assembly-line

